# GetParentId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkType..::..GetParentId Method
RevitLinkType Class See Also
---
Gets the id of this link's immediate parent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId GetParentId()
```

Visual Basic
---
```text
Public Function GetParentId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetParentId()
```

# ### Return Value
The id of the immediate parent of this link, or invalidElementId if this link is a top-level link.
# Remarks
This function returns the immediate parent id. Given the link structure A -> B -> C, then calling this function on C will return B's id. Call GetRootId to get A's id.
# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace